GopalSaraf/Practicals/PSDL/include/proc/pic16f1784.inc
// Register: PSMC2BLKF
#define PSMC2BLKF PSMC2BLKF
PSMC2BLKF                                equ 084Ch
// bitfield definitions
PSMC2BLKF_PSMC2BLKF0_POSN                equ 0000h
PSMC2BLKF_PSMC2BLKF0_POSITION            equ 0000h
PSMC2BLKF_PSMC2BLKF0_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF0_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF0_MASK                equ 0001h
PSMC2BLKF_PSMC2BLKF1_POSN                equ 0001h
PSMC2BLKF_PSMC2BLKF1_POSITION            equ 0001h
PSMC2BLKF_PSMC2BLKF1_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF1_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF1_MASK                equ 0002h
PSMC2BLKF_PSMC2BLKF2_POSN                equ 0002h
PSMC2BLKF_PSMC2BLKF2_POSITION            equ 0002h
PSMC2BLKF_PSMC2BLKF2_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF2_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF2_MASK                equ 0004h
PSMC2BLKF_PSMC2BLKF3_POSN                equ 0003h
PSMC2BLKF_PSMC2BLKF3_POSITION            equ 0003h
PSMC2BLKF_PSMC2BLKF3_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF3_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF3_MASK                equ 0008h
PSMC2BLKF_PSMC2BLKF4_POSN                equ 0004h
PSMC2BLKF_PSMC2BLKF4_POSITION            equ 0004h
PSMC2BLKF_PSMC2BLKF4_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF4_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF4_MASK                equ 0010h
PSMC2BLKF_PSMC2BLKF5_POSN                equ 0005h
PSMC2BLKF_PSMC2BLKF5_POSITION            equ 0005h
PSMC2BLKF_PSMC2BLKF5_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF5_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF5_MASK                equ 0020h
PSMC2BLKF_PSMC2BLKF6_POSN                equ 0006h
PSMC2BLKF_PSMC2BLKF6_POSITION            equ 0006h
PSMC2BLKF_PSMC2BLKF6_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF6_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF6_MASK                equ 0040h
PSMC2BLKF_PSMC2BLKF7_POSN                equ 0007h
PSMC2BLKF_PSMC2BLKF7_POSITION            equ 0007h
PSMC2BLKF_PSMC2BLKF7_SIZE                equ 0001h
PSMC2BLKF_PSMC2BLKF7_LENGTH              equ 0001h
PSMC2BLKF_PSMC2BLKF7_MASK                equ 0080h

// Register: PSMC2FFA
#define PSMC2FFA PSMC2FFA
PSMC2FFA                                 equ 084Dh
// bitfield definitions
PSMC2FFA_PSMC2FFA0_POSN                  equ 0000h
PSMC2FFA_PSMC2FFA0_POSITION              equ 0000h
PSMC2FFA_PSMC2FFA0_SIZE                  equ 0001h
PSMC2FFA_PSMC2FFA0_LENGTH                equ 0001h
PSMC2FFA_PSMC2FFA0_MASK                  equ 0001h
PSMC2FFA_PSMC2FFA1_POSN                  equ 0001h
PSMC2FFA_PSMC2FFA1_POSITION              equ 0001h
PSMC2FFA_PSMC2FFA1_SIZE                  equ 0001h
PSMC2FFA_PSMC2FFA1_LENGTH                equ 0001h
PSMC2FFA_PSMC2FFA1_MASK                  equ 0002h
PSMC2FFA_PSMC2FFA2_POSN                  equ 0002h
PSMC2FFA_PSMC2FFA2_POSITION              equ 0002h
PSMC2FFA_PSMC2FFA2_SIZE                  equ 0001h
PSMC2FFA_PSMC2FFA2_LENGTH                equ 0001h
PSMC2FFA_PSMC2FFA2_MASK                  equ 0004h
PSMC2FFA_PSMC2FFA3_POSN                  equ 0003h
PSMC2FFA_PSMC2FFA3_POSITION              equ 0003h
PSMC2FFA_PSMC2FFA3_SIZE                  equ 0001h
PSMC2FFA_PSMC2FFA3_LENGTH                equ 0001h
PSMC2FFA_PSMC2FFA3_MASK                  equ 0008h

// Register: PSMC2STR0
#define PSMC2STR0 PSMC2STR0
PSMC2STR0                                equ 084Eh
// bitfield definitions
PSMC2STR0_P2STRA_POSN                    equ 0000h
PSMC2STR0_P2STRA_POSITION                equ 0000h
PSMC2STR0_P2STRA_SIZE                    equ 0001h
PSMC2STR0_P2STRA_LENGTH                  equ 0001h
PSMC2STR0_P2STRA_MASK                    equ 0001h
PSMC2STR0_P2STRB_POSN                    equ 0001h
PSMC2STR0_P2STRB_POSITION                equ 0001h
PSMC2STR0_P2STRB_SIZE                    equ 0001h
PSMC2STR0_P2STRB_LENGTH                  equ 0001h
PSMC2STR0_P2STRB_MASK                    equ 0002h

// Register: PSMC2STR1
#define PSMC2STR1 PSMC2STR1
PSMC2STR1                                equ 084Fh
// bitfield definitions
PSMC2STR1_P2HSMEN_POSN                   equ 0000h
PSMC2STR1_P2HSMEN_POSITION               equ 0000h
PSMC2STR1_P2HSMEN_SIZE                   equ 0001h
PSMC2STR1_P2HSMEN_LENGTH                 equ 0001h
PSMC2STR1_P2HSMEN_MASK                   equ 0001h
PSMC2STR1_P2LSMEN_POSN                   equ 0001h
PSMC2STR1_P2LSMEN_POSITION               equ 0001h
PSMC2STR1_P2LSMEN_SIZE                   equ 0001h
PSMC2STR1_P2LSMEN_LENGTH                 equ 0001h
PSMC2STR1_P2LSMEN_MASK                   equ 0002h
PSMC2STR1_P2SSYNC_POSN                   equ 0007h
PSMC2STR1_P2SSYNC_POSITION               equ 0007h
PSMC2STR1_P2SSYNC_SIZE                   equ 0001h
PSMC2STR1_P2SSYNC_LENGTH                 equ 0001h
PSMC2STR1_P2SSYNC_MASK                   equ 0080h

// Register: PSMC3CON
#define PSMC3CON PSMC3CON
PSMC3CON                                 equ 0851h
// bitfield definitions
PSMC3CON_P3MODE_POSN                     equ 0000h
PSMC3CON_P3MODE_POSITION                 equ 0000h
PSMC3CON_P3MODE_SIZE                     equ 0004h
PSMC3CON_P3MODE_LENGTH                   equ 0004h
PSMC3CON_P3MODE_MASK                     equ 000Fh
PSMC3CON_P3DBRE_POSN                     equ 0004h
PSMC3CON_P3DBRE_POSITION                 equ 0004h
PSMC3CON_P3DBRE_SIZE                     equ 0001h
PSMC3CON_P3DBRE_LENGTH                   equ 0001h
PSMC3CON_P3DBRE_MASK                     equ 0010h
PSMC3CON_P3DBFE_POSN                     equ 0005h
PSMC3CON_P3DBFE_POSITION                 equ 0005h
PSMC3CON_P3DBFE_SIZE                     equ 0001h
PSMC3CON_P3DBFE_LENGTH                   equ 0001h
PSMC3CON_P3DBFE_MASK                     equ 0020h
PSMC3CON_PSMC3LD_POSN                    equ 0006h
PSMC3CON_PSMC3LD_POSITION                equ 0006h
PSMC3CON_PSMC3LD_SIZE                    equ 0001h
PSMC3CON_PSMC3LD_LENGTH                  equ 0001h
PSMC3CON_PSMC3LD_MASK                    equ 0040h
PSMC3CON_PSMC3EN_POSN                    equ 0007h
PSMC3CON_PSMC3EN_POSITION                equ 0007h
PSMC3CON_PSMC3EN_SIZE                    equ 0001h
PSMC3CON_PSMC3EN_LENGTH                  equ 0001h
PSMC3CON_PSMC3EN_MASK                    equ 0080h
PSMC3CON_P3MODE0_POSN                    equ 0000h
PSMC3CON_P3MODE0_POSITION                equ 0000h
PSMC3CON_P3MODE0_SIZE                    equ 0001h
PSMC3CON_P3MODE0_LENGTH                  equ 0001h
PSMC3CON_P3MODE0_MASK                    equ 0001h
PSMC3CON_P3MODE1_POSN                    equ 0001h
PSMC3CON_P3MODE1_POSITION                equ 0001h
PSMC3CON_P3MODE1_SIZE                    equ 0001h
PSMC3CON_P3MODE1_LENGTH                  equ 0001h
PSMC3CON_P3MODE1_MASK                    equ 0002h
PSMC3CON_P3MODE2_POSN                    equ 0002h
PSMC3CON_P3MODE2_POSITION                equ 0002h
PSMC3CON_P3MODE2_SIZE                    equ 0001h
PSMC3CON_P3MODE2_LENGTH                  equ 0001h
PSMC3CON_P3MODE2_MASK                    equ 0004h
PSMC3CON_P3MODE3_POSN                    equ 0003h
PSMC3CON_P3MODE3_POSITION                equ 0003h
PSMC3CON_P3MODE3_SIZE                    equ 0001h
PSMC3CON_P3MODE3_LENGTH                  equ 0001h
PSMC3CON_P3MODE3_MASK                    equ 0008h

// Register: PSMC3MDL
#define PSMC3MDL PSMC3MDL
PSMC3MDL                                 equ 0852h
// bitfield definitions
PSMC3MDL_P3MSRC_POSN                     equ 0000h
PSMC3MDL_P3MSRC_POSITION                 equ 0000h
PSMC3MDL_P3MSRC_SIZE                     equ 0004h
PSMC3MDL_P3MSRC_LENGTH                   equ 0004h
PSMC3MDL_P3MSRC_MASK                     equ 000Fh
PSMC3MDL_P3MDLBIT_POSN                   equ 0005h
PSMC3MDL_P3MDLBIT_POSITION               equ 0005h
PSMC3MDL_P3MDLBIT_SIZE                   equ 0001h
PSMC3MDL_P3MDLBIT_LENGTH                 equ 0001h
PSMC3MDL_P3MDLBIT_MASK                   equ 0020h
PSMC3MDL_P3MDLPOL_POSN                   equ 0006h
PSMC3MDL_P3MDLPOL_POSITION               equ 0006h
PSMC3MDL_P3MDLPOL_SIZE                   equ 0001h
PSMC3MDL_P3MDLPOL_LENGTH                 equ 0001h
PSMC3MDL_P3MDLPOL_MASK                   equ 0040h
PSMC3MDL_P3MDLEN_POSN                    equ 0007h
PSMC3MDL_P3MDLEN_POSITION                equ 0007h
PSMC3MDL_P3MDLEN_SIZE                    equ 0001h
PSMC3MDL_P3MDLEN_LENGTH                  equ 0001h
PSMC3MDL_P3MDLEN_MASK                    equ 0080h
PSMC3MDL_P3MSRC0_POSN                    equ 0000h
PSMC3MDL_P3MSRC0_POSITION                equ 0000h
PSMC3MDL_P3MSRC0_SIZE                    equ 0001h
PSMC3MDL_P3MSRC0_LENGTH                  equ 0001h
PSMC3MDL_P3MSRC0_MASK                    equ 0001h
PSMC3MDL_P3MSRC1_POSN                    equ 0001h
PSMC3MDL_P3MSRC1_POSITION                equ 0001h
PSMC3MDL_P3MSRC1_SIZE                    equ 0001h
PSMC3MDL_P3MSRC1_LENGTH                  equ 0001h
PSMC3MDL_P3MSRC1_MASK                    equ 0002h
PSMC3MDL_P3MSRC2_POSN                    equ 0002h
PSMC3MDL_P3MSRC2_POSITION                equ 0002h
PSMC3MDL_P3MSRC2_SIZE                    equ 0001h
PSMC3MDL_P3MSRC2_LENGTH                  equ 0001h
PSMC3MDL_P3MSRC2_MASK                    equ 0004h
PSMC3MDL_P3MSRC3_POSN                    equ 0003h
PSMC3MDL_P3MSRC3_POSITION                equ 0003h
PSMC3MDL_P3MSRC3_SIZE                    equ 0001h
PSMC3MDL_P3MSRC3_LENGTH                  equ 0001h
PSMC3MDL_P3MSRC3_MASK                    equ 0008h

// Register: PSMC3SYNC
#define PSMC3SYNC PSMC3SYNC
PSMC3SYNC                                equ 0853h
// bitfield definitions
PSMC3SYNC_P3SYNC0_POSN                   equ 0000h
PSMC3SYNC_P3SYNC0_POSITION               equ 0000h
PSMC3SYNC_P3SYNC0_SIZE                   equ 0001h
PSMC3SYNC_P3SYNC0_LENGTH                 equ 0001h
PSMC3SYNC_P3SYNC0_MASK                   equ 0001h
PSMC3SYNC_P3SYNC1_POSN                   equ 0001h
PSMC3SYNC_P3SYNC1_POSITION               equ 0001h
PSMC3SYNC_P3SYNC1_SIZE                   equ 0001h
PSMC3SYNC_P3SYNC1_LENGTH                 equ 0001h
PSMC3SYNC_P3SYNC1_MASK                   equ 0002h
PSMC3SYNC_P3SYNC2_POSN                   equ 0002h
PSMC3SYNC_P3SYNC2_POSITION               equ 0002h
PSMC3SYNC_P3SYNC2_SIZE                   equ 0001h
PSMC3SYNC_P3SYNC2_LENGTH                 equ 0001h
PSMC3SYNC_P3SYNC2_MASK                   equ 0004h
PSMC3SYNC_P3DCPOL_POSN                   equ 0005h
PSMC3SYNC_P3DCPOL_POSITION               equ 0005h
PSMC3SYNC_P3DCPOL_SIZE                   equ 0001h
PSMC3SYNC_P3DCPOL_LENGTH                 equ 0001h
PSMC3SYNC_P3DCPOL_MASK                   equ 0020h
PSMC3SYNC_P3PRPOL_POSN                   equ 0006h
PSMC3SYNC_P3PRPOL_POSITION               equ 0006h
PSMC3SYNC_P3PRPOL_SIZE                   equ 0001h
PSMC3SYNC_P3PRPOL_LENGTH                 equ 0001h
PSMC3SYNC_P3PRPOL_MASK                   equ 0040h
PSMC3SYNC_P3POFST_POSN                   equ 0007h
PSMC3SYNC_P3POFST_POSITION               equ 0007h
PSMC3SYNC_P3POFST_SIZE                   equ 0001h
PSMC3SYNC_P3POFST_LENGTH                 equ 0001h
PSMC3SYNC_P3POFST_MASK                   equ 0080h

